app/controllers/airlines_controller.rb

  def index
     @airlines = Airline.sorted(params[:sort], "lid ASC").page(params[:page])
---
SELECT  `airlines`.* FROM `airlines`   ORDER BY lid DESC LIMIT 100 OFFSET 60000
SELECT COUNT(*) FROM `airlines`

    def set_airline
      @airline = Airline.find(params[:id])
---
SELECT  `airlines`.* FROM `airlines`  WHERE `airlines`.`lid` = 161 LIMIT 1