app/controllers/airports_controller.rb

SELECT  `airports`.* FROM `airports`   ORDER BY pid LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM `airports`
---
  def index
    @airports = Airport.sorted(params[:sort], "pid ASC").page(params[:page])